Public Attributes | List of all members
API_ArcType Struct Reference
Element Manager
Represents an elliptical or circular arc. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_ExtendedPenType  | linePen
(Overridden) pen attribute index.
 API_AttributeIndex  | ltypeInd
Line type attribute index.
 bool  | roomSeparator
Is this arc a zone boundary?
short  | determination
Determines the type of this line.Line category:
 API_ArrowData  | arrowData
Arrow data for the arc ends.
 double  | penWeight
Pen weight for the arc (can override the weight in linePen, otherwise set it to API_DefPenWeigth : use default weight of the pen).
 API_Coord  | origC
Coordinate of the center point.
 double  | r
Radius.
 double  | angle
0.0, or the angle of the 'a' axis.
 double  | ratio
1.0, or 'a/b' of the ellipse.
 double  | begAng
Beginning angle of the arc.
 double  | endAng
End angle of the arc.
 bool  | reflected
Is the ellipse reflected onto the smaller axis?
 bool  | whole
Is this a whole arc? (output only)
Detailed Description
Represents an elliptical or circular arc.
Member Data Documentation
◆ determination
 API_ArcType::determination
Determines the type of this line.Line category:
 Type  | Meaning
 APILine_DetOrigin  | Default line category. Lines in the Drafting line category are not affected by the Line Weight and Section Fill settings chosen in Display Options.
 APILine_DetInnerLine  | A skin separator line separates skins of composite structures. Lines in the Skin Separator category will be either hidden or shown depending on the Cut Fill type chosen in Display Options. Also, lines in the Skin Separator category can be optionally placed onto their own layer during DXF/DWG conversion functions.
 APILine_DetContourLine  | Lines in the Cut line category will be affected if you have chosen the 'Bold Cut Line' setting in the Line Weight menu of Display Options.